Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/J32.tmx
Source language: en_us
Languages: zh_cn

source: 2 Models and Methods
zh_cn: 第二章 模式和方法

source: This chapter is concerned with four general approaches which are common to various disciplines, but highly controversial in some of them.
zh_cn: 这一章关注对于各种学科有普遍意义的四种基本研究方法，其中有些引起激烈争论和不同意见。

source: Its four sections deal in tum with comparison, with the use of models, with quantitative methods and, finally, with the employment of the social 'microscope'.
zh_cn: 四个小节分别讨论比较、模式的运用、计量方法以及社会“显微镜”的使用。

source: Comparison
zh_cn: 比较

source: Comparison has always had a central place in social theory.
zh_cn: 比较总是在社会理论里扮演举足轻重的角色。

source: Indeed, Durkheim declared that, 'Comparative sociology is not a special branch of sociology; it is sociology itself.' He emphasized the value of the study of 'concomitant variation' in particular as a kind of 'indirect experiment' which allowed the sociologist to move from the description of a society to an analysis of why it takes a particular form.
zh_cn: 正像涂尔干指出的：“比较社会学并非社会学的一支，它就是社会学本身。”他尤其强调研究“同变”（concomitant variation）的价值，因为这种研究是一种“间接实验”，使得社会学家能够从对社会的描述转向分析它为什么采取此种或彼种形式。

source: He distinguished two kinds of comparison, both of which he advocated. In the first place, comparisons between societies which are fundamentally the same in structure, or, as he put it in a revealing biological metaphor, 'of the same species', and in the second place, comparisons between societies which are fundamentally different.
zh_cn: 他区别了两种他都倡导的比较方法，第一种是比较结构基本相同的社会，即他用贴切的生物学比喻来表示的“同一种类的”（of the same species）社会；第二种是比较结构基本不同的社会（Durkheim 1985：ch.6；参见Beteille 1991）。

source: 1The influence of Durkheim on comparative linguistics and comparative literature, especially in France, is obvious enough.
zh_cn: 尤其在法国，涂尔干在比较语言学和比较文学领域的影响是显而易见的。

source: Historians, on the other hand, tended to reject comparison, on the grounds that they are concerned with the particular, the unique, the unrepeatable.
zh_cn: 另一方面，由于历史学家所关注的是特殊、唯一和不可重复的东西，因此倾向于拒绝比较方法。

source: To this classic objection there is, however, an equally classic answer, given by Max Weber in 1914 to the historian Georg von Below, in the course of a debate on urban history. 'We are absolutely in accord that history should establish what is specific, say, to the medieval city; but this is possible only if we first find what is missing in other cities (ancient, Chinese, Islamic).'
zh_cn: 1914年，在一场有关城市史的争论中，针对这种经典式的反对意见，马克斯·韦伯对历史学家格奥尔格·冯·贝娄作出一个经典式的回答：“我们对这一点毫无异议：就是历史学应该确定中世纪的城市有什么特殊之处；但只有我们首先找出其他的城市（古代城市、中国城市、伊斯兰城市）缺乏什么，我们才能做到这一点”（转引自Roth 1976：307）。美国社会学家莱因哈德·本迪克斯所说的“对照概念”乃是比较方法的基本因素。

source: It is only thanks to comparison that we are able to see what is not there, in other words to understand the significance of a particular absence.
zh_cn: 只有通过比较，我们才能了解什么是它所缺乏的，换句话说，才能理解某种缺失的意义所在。

source: This was the point of Werner Sombart's famous essay, Why is there no socialism in the United States? It was also the strategy underlying Weber's own essay on the city, which argued that the truly autonomous city could only be found in the West. Indeed, Weber spent much of his working life in the attempt to define the distinctive characteristics of Western civilization (notably what he called its institutionalized 'rationality'), by means of systematic comparisons between Europe and Asia in the economic, political and religious spheres and even in that of music. He paid particular attention to the rise of Protestantism, capitalism and bureaucracy in the West, arguing that the three phenomena were at once similar and connected, and contrasting them with phenomena elsewhere (what Reinhard Bendix calls 'contrast-conceptions' are fundamental to the comparative approach).
zh_cn: 维尔纳·桑巴特的著名论文《为什么美国没有社会主义？》正是基于这一主旨（后来的一些研究，如非洲没有封建主义，英国没有马克思主义，美国没有足球运动，都是如此）（Goody 1969；Mckibbin 1984）。韦伯本人有关城市的论文也是基于这种思路。他指出，真正的自治城市仅见于西方（Sombart 1906；Weber 1920：iii.1212—1374；参见Milo 1990）。

source: The implication of these examples is that the two approaches, particularizing and generalizing (or historical and theoretical), complement each other, and that both of them depend on comparison, whether explicit or implicit.
zh_cn: 上述例子表明，特殊研究和一般研究（历史探讨和理论探讨）这两种方法相互补充、相得益彰，并且都有赖于明确或隐蔽的比较才得以实现。

source: The American historian Jack Hexter once divided intellectuals into 'lumpers' and 'splitters', arguing that the discriminating splitters are superior to those who regard diverse phenomena as a single lump.
zh_cn: 美国历史学家杰克·赫克斯特曾将知识分子分为“堆砌者”和“分解者”两类。他认为，有鉴别力的分解者优于那些将纷繁的现象混为一堆的人（Hexter 1979：242）。

source: Of course no one wants to be a coarse lumper, incapable of making fine distinctions.
zh_cn: 当然，没有人想成为一个粗笨的、无力作精细区分的堆砌者。

source: However, to see what apparently diverse phenomena have in common is surely as valuable an intellectual quality as to see how apparently similar phenomena differ.
zh_cn: 然而，能从纷繁的现象中发现共通的一面，正如能从表面相似的现象中看到差别一样，也是一种可贵的学术素质。

source: In any case, splitting too depends on a prior act of comparison.
zh_cn: 无论怎样，分解也同样有赖于先行的比较。

source: Among the first historians to follow the lead of Durkheim and Weber were Marc Bloch and Otto Hintze.
zh_cn: 最早追随涂尔干和韦伯的历史学家有马克·布洛克和奥托·欣泽。

source: Hintze learned the comparative method from Weber, though he confined his analysis to Europe. He concentrated on the development in different European states of what Weber called 'legal-rational' or 'bureaucratic' forms of government, noting, for example, the significance of the rise of the commissarius, an official who had not bought his office (as was customary in early modem Europe) and was therefore removable at the king's will?
zh_cn: 欣泽从韦伯那里学来比较方法，但他的研究局限于欧洲，集中于不同的欧洲国家中韦伯所谓的“法理型”或“官僚制”政府形式的发展。例如，他注意到“委任官员”（commissarius）兴起的重要意义。“委任官员”是这样一类官员，他不是像近代早期欧洲通行的那样花钱买到官职，因此国王可以随意撤换（Hintze 1975：267—301）。

source: For his part, Marc Bloch learned the comparative method from Durkheim and his followers, notably the linguist Antoine Meillet.
zh_cn: 马克·布洛克是从涂尔干及其追随者一尤其是安托万·梅耶——那里学来比较方法的（Sewell 1967；Rhodes 1978；Atsma and Burguieve 1990：255-334）。

source: He defined it in a similar way to them, distinguishing comparisons between 'neighbours' from those between societies remote from each other in place and time.
zh_cn: 他以与他们相似的方法界定它，区分了两种比较，一是“邻近”社会之间的比较，一是时空相距甚远的社会之间的比较。

source: He advocated the method on similar grounds, because it allowed the historian 'to take a real step forward in the exciting search for causes'.
zh_cn: 布洛克还基于相似的理由倡导这种方法，因为它使历史学家“能够在寻求历史缘故的、令人兴奋的研究中迈出坚实的一步M（Bloch 1928；参见Detienne 1999）。

source: Two of Bloch's comparative studies are particularly famous.
zh_cn: 布洛克的比较研究专著中有两部非常有名。

source: The Royal Touch (1924) developed a comparison between neighbours, England and France, the two countries whose rulers were believed to possess the power to cure scrofula by touching the sufferer.
zh_cn: 《国王的触摸》（1924年）是对英国和法国这一对邻居所作的一种比较。这两个国家的统治者都被认为拥有触摸患者而治愈淋巴结核的能力；《封建社会》（1939—1940年）一书则是对欧洲的概述，但也有一节是论述日本。

source: Feudal Society (1939-40) surveyed medieval Europe, but also included a section on Japan, noting the similarities in the position of knights and samurai but also emphasizing the difference between the unilateral obligation which bound the samurai to his master and the bilateral obligation between lord and vassal in Europe, where the junior partner had the right of rebellion if the senior partner did not keep his share of the bargain.
zh_cn: 该书指出欧洲骑士和日本武士在地位上的相似性，同时强调他们之间的差异，即日本武士对主人负有单方面义务，而欧洲领主与封臣之间是双向义务关系。在欧洲，如果上级合作者不能恪守他的义务，那么下级合作者就有权反叛（参见P-Anderson 1974：435—1）。

source: After the Second World War, comparative studies gained momentum, especially in the United States, with the rise of sub-disciplines such as development economics, comparative literature and comparative politics.
zh_cn: 二战以后，尤其在美国，随着发展经济学、比较文学和比较政治学等分支学科的兴起，比较研究获得了新的动力。

source: The foundation of the journal Comparative Studies in Society and History in 1958 was part of the same trend.
zh_cn: 1958年，《社会和历史比较研究》杂志的创立即体现了这一趋势（Atsma and Burguieve1990；323—34）。

source: 10 Although many professional historians remain suspicious of comparison, it is possible to point to a few areas where the method has proved to be extremely fruitful.
zh_cn: 尽管这时仍有许多专业历史学家对比较方法持怀疑态度，但在若干领域里，该方法的确果实累累。

source: In economic history, for example, the process of industrialization is often viewed in a comparative perspective.
zh_cn: 比如说在经济史方面，人们就常常用比较的眼光审视工业化的进程。

source: Following the sociologist Thorstein Veblen, who published an essay on Germany and the industrial revolution, historians have asked whether other industrializing nations followed or diverged from the English model, and whether latecomers, like Germany and Japan, enjoyed advantages over their predecessors.
zh_cn: 社会学家索尔斯坦·凡勃伦早就推出了有关德国及其工业革命的研究。历史学家也循其思路，开始探讨其他工业化国家是追随还是背离了英国模式，像德国和日本那样的后起者是否比先行者占优势（Veblen 1915；Rostow 1958；Gershenkron 1962）。

source: In the case of political history, it is the comparative study of revolutions which has attracted most interest.
zh_cn: 在政治史方面，对革命问题的比较研究最引人注目。

source: Among the best-known works in this genre are Barrington Moore's analysis of the 'social origins of dictatorship and democracy', which ranges from seventeenth-century England to nineteenth-century Japan; Lawrence Stone's essay on 'The Causes of the English Revolution'; and Theda Skocpol's study of France in 1789, Russia in 1917 and China in 1911, as cases which 'reveal similar causal patterns'."
zh_cn: 这类研究中最著名的有巴林顿·摩尔的《民主和专制的社会起源》，该书涵盖了从17世纪的英格兰到19世纪的日本（Moore 1966）；西达·斯考切波对1789年的法国、1917年的俄国和1911年的中国所作的比较研究，她认为它们“显示了相似的因果关系模式”（Skocpol l979），以及杰克·戈德斯通论述近代早期欧洲、奥斯曼帝国和中国的革命与反叛的著作（Goldstone 1991）。

source: Moore makes particularly effective., use of comparison as a means of testing general explanations (he is interested in what does not fit, as Weber was interested in what is not there).
zh_cn: 摩尔特别有效地利用比较方法来检验一般解释（正像韦伯关注缺什么，他关心的是什么不适合）。

source: In his own words: Comparisons can serve as a rough negative check on accepted historical explanations ...after learning about the disastrous consequences for democracy of a coalition between agrarian and industrial elites in nineteenth- and early twentieth-century Germany, the much discussed marriage of iron and rye - one wonders why a similar marriage between iron and cotton did not prevent the coming of the Civil War in the United States.
zh_cn: 用他自己的话来说就是：“比较方法可以对公认的历史解释提出一种初步的否定性查验。......在研究了19世纪和20世纪早期德国工农业精英之间的联盟——即众说纷纭的钢铁与黑麦的联姻——对民主造成的灾难性后果之后，人们不禁要问：在美国，钢铁和棉花的类似联姻为什么没能阻挡内战的爆发。”

source: In social history, the comparative study of feudalism, inspired by Marc Bloch, continues to flourish, with discussions of India and Africa as well as Europe and Japan.
zh_cn: 在知识史领域里，科学史研究常常使用比较方法。例如，李约瑟是从生化学家转为汉学家。他特别想解释为什么中国没有发生科学革命。另外一个古史研究者杰弗里·劳埃德则对古代希腊和中国的理解世界方式进行了比较（J.Needham 1963；参见Huff 1993；G.E.R.Lloyd 2002）。

source: The suggestion that it was the tsetse fly which — by attacking horses — prevented the development of anything like feudalism in West Africa is one of the most fascinating studies of 'what is missing', as Weber called it."
zh_cn: 在社会史方面，受马克·布洛克的启发，对封建社会的比较研究方兴未艾，有关讨论既涉及欧洲和日本，也涉及印度和非洲。英国人类学家杰克·古迪认为，在西非，正是舌蝇 种攻击马的蝇——阻止了任何类似封建主义的东西的生成。这一见解就是对韦伯所谓“缺什么”的研究中最迷人的一项（Goody 1969）。

source: Comparative marriage patterns are the subject of a famous study by John Hajnal which contrasts the West European system of late marriage linked to the establishment of an independent household for the newly-weds, with the practices prevalent in the rest of the world.
zh_cn: 婚姻模式比较则是约翰·哈伊纳尔的一项著名研究的主题。他比较了西欧因新婚夫妇需另立家业而造成的晚婚习俗和流行于世界其他地方的婚姻方式（Hajnal 1965）。

source: In his turn Hajnal has stimulated other comparative studies, notably an essay by Jack Goody arguing that the West European system was the creation of the medieval Church, which discouraged marriages between relatives in order to increase its chances of inheriting from the unmarried.
zh_cn: 哈伊纳尔的研究进而刺激了其他比较研究的涌现，其中著名的有杰克·古迪的一篇论文。这篇论文指出，西欧的这种习俗是中世纪教会的产物，因为教会为了增加获取未婚者遗赠财产的几率而不鼓励亲戚之间通婚（Goody1983）。

source: Using a strategy much like Weber's, the historical anthropologist Alan Macfarlane has published a series of studies which attempt to define the Englishness of English society (individualism, a low propensity to violence, a culture particularly compatible with capitalism, and so on), by means of comparisons and contrasts with other parts' of Europe, from Poland to Sicily.
zh_cn: 历史人类学家阿伦·麦克法伦也使用与韦伯极其类似的方法，发表了一系列研究成果。他通过把英国与从波兰到西西里的欧洲其他地区进行比较和对照，试图界定英国社会的英国特色（个人主义、较低的暴力倾向、与资本主义极其相容的文化等等）（Macfarlane 1979，1986，1987）。

source: It would not be difficult to add to this brief list of examples, but they are perhaps sufficient to show that comparative history has a number of substantial achievements to its credit.
zh_cn: 可以列举的例子还很多，不过上面的例子已经足以表明，比较历史研究取得了与其名气相符的一系列可观成就。

source: It also has its dangers two in particular.
zh_cn: 但它也存在危险，尤其在以下两个方面。

source: In the first place, there is the danger accepting too easily the assumption that societies 'evolve' through an inevitable sequence of stages.
zh_cn: 其一，当过于简单地接受社会通过一系列不可避免的过程而进化这一假设时，危险就在所难免。

source: The comparative method of Marx, Comte, Spencer, Durkheim and other nineteenth-century scholars consisted essentially in identifying the stage which a particular society had reached, in placing it on the ladder of social evolution.
zh_cn: 马克思、孔德、斯宾塞、涂尔干以及其他19世纪学者的比较方法，在本质上都是要论证一种特定社会已经达到的阶段，以便将它置于社会进化的阶梯中。

source: To many scholars today, this assumption no longer seems tenable (below, p. 134).
zh_cn: 在今天的许多学者看来，这种假设再也站不住脚了（参见本书第144页）。

source: The problem is then to make comparative analyses which are neither evolutionist nor static - as Weber's tended to be - but take account of the different paths along which a society may travel.
zh_cn: 因此，所要作的比较分析既不应该是进化论的，也不应该是静态的——即韦伯努力要做的——而应该是解释一个社会可能要走的不同道路（P-Anderson 1974：417）。

source: In the second place, there is the danger of ethnocentrism.
zh_cn: 其二，存在种族中心论的危险。

source: It may well seem odd to point out such a danger, since comparative analysis has long been associated with the increasing awareness of non-Western cultures on the part of Western scholars.
zh_cn: 指出这样一种危险似乎显得古怪，因为比较研究长期以来就与西方学者愈益深化对非西方文明的认识密切相关。

source: All the same, these scholars have often treated the West as a norm from which other cultures diverge. 'Feudalism', for example, like 'capitalism', is a concept originally formulated on the basis of Western experience. There is an obvious danger of trying to force other people's history into Western categories of this kind.
zh_cn: 但是，这些学者仍然时常将西方当作一种常态，认为其他文明都偏离了这种常态。

source: The case of 'feudalism' in the Indian kingdom of Rajasthan, for example, is a cautionary tale which would-be comparative historians might do well to bear in mind.
zh_cn: 印度拉贾斯坦王国的“封建主义”就是这么一个警示性的例子，有志于做比较历史学家的人应该将它铭记于心。

source: In 1829, James Tod presented to the public what he called a 'Sketch of a Feudal System in Rajasthan'.
zh_cn: 1829年，詹姆斯·托德向公众发表了他所谓的“拉贾斯坦封建体系素描”。

source: Relying on Henry Hallam's recent View of the State of Europe during the Middle Ages (1818), Tod emphasized relatively superficial analogies between the two societies.
zh_cn: 他依据亨利·哈勒姆的近作《中世纪欧洲状态考察》（View of the State of Europe during the Middle Ages，1818年）一书，比较肤浅地强调两个社会的相似性。

source: With Hallam in his head, he failed to notice the greater importance of family relationships between 'lords' and 'vassals' in the Indian case.
zh_cn: 由于哈勒姆的观点占据了他的思想，托德也就无法注意到在印度“领主”和“封臣”之间的家庭关系具有更重要的作用（Thorner 1956；参见Mukhia 1980—1；Peabody 1996）。

source: Another problem is that of deciding what exactly to compare with what.
zh_cn: 另一个问题在于选择什么具有确切的可比性的因素。

source: The comparatists of the nineteenth century, such as Sir James Frazer, concentrated attention on similarities between specific cultural traits or customs, ignoring the social context of those customs, which was often quite different.
zh_cn: 像詹姆斯·弗雷泽爵士这样的19世纪比较学家，就将注意力集中在特定的文化特征或风格之间的相似性上，而忽视了这些风俗的社会背景常常是多么地不同。

source: For this their analyses have been criticized, like Tod's, as superficial.
zh_cn: 正因为如此，像托德那样肤浅的分析遭到了批驳（Leach 1965）。

source: What is the alternative?
zh_cn: 那么什么才是可行的呢？

source: The functionalists (below, p. 104) would say that the true objects of study are the functional equivalents in different societies.
zh_cn: 功能主义者（参见本书第128页）可能会说，正确的研究对象应该是不同的社会里的“功能相似物”。

source: Robert Bellah, for example, noting the discrepancy between the Japanese economic achievement (as early as the seventeenth century) and Weber's hypothesis about the connection between capitalism and Protestantism, suggested that a certain type of Japanese Buddhism was functionally analogous in the sense of encouraging an ethos of hard work and thrift similar to the Protestant ethic.
zh_cn: 比如说，美国社会学家罗伯特·贝拉注意到日本的经济发展（早在17世纪）就有别于韦伯关于资本主义与新教关联的假设，他进而提出，在鼓励勤奋工作、勤俭节约道德观方面，有一派佛教与“新教伦理”在功能上相26类似（Bellah 1959）。

source: In the course of solving one problem, however, we find ourselves faced with others.
zh_cn: 然而，就在我们解决某个问题的过程中，另一些问题又出现了。

source: The concept of a 'functional equivalent' forms part of an intellectual package, 'functionalism', which is open to criticism (below, p. 104).
zh_cn: “功能相似物”概念乃是一件学术包裹，即“功能主义”的一部分，而功能主义已受到激烈的批评（参见本书第130页）。

source: In any case, examples of functional equivalents are not always as clear as Bellah's.
zh_cn: 无论怎样，功能相似物的例子并非总是像贝拉阐释的那么清晰。

source: How do we decide what counts as an analogue?
zh_cn: 我们怎么能肯定什么是相似的？

source: Comparatists face a dilemma.
zh_cn: 比较学家们便面临两难之境。

source: If we compare specific cultural traits, we have fixed on something precise, and can note its presence or absence, but we risk superficiality. The search for analogues, on the other hand, leads towards comparisons between whole societies.
zh_cn: 如果我们比较特定的文化特征，那么我们已然注目于确定无疑的一些东西，并能指出它是否存在或缺乏，但这样做我们便冒着肤浅之嫌；另一方面，寻找类似物会把我们导向对整个社会的比较。

source: Yet how can one usefully compare or contrast societies which differ from each other in so many different ways?
zh_cn: 然而，我们又怎能有效地对在诸多方面截然不同的整体社会加以比较或对照呢？

source: The problems of comparison on the grand scale become apparent if we look at a famous example, Arnold Toynbee's massive Study of History.
zh_cn: 大范围比较所存在的问题可以从一个有名的例证中看出来。这个例子就是阿诺德·汤因比的巨著《历史研究》（A.Toynbee 1935—61；McIntire and Perry 1989；McNeill 1989）。

source: Toynbee's unit of comparison was a 'civilization', and he distinguished some twenty such civilizations in world history.
zh_cn: 汤因比的比较单位是“文明”，他区别了世界史中20多个这样的文明。

source: He had of course to reduce each civilization to a small bundle of traits in order to make comparison possible.
zh_cn: 为了使他的比较成为可能，他很自然地要把每个文明简化为几个特征。

source: As his critics were quick to point out, he also had to create artificial barriers between civilizations.
zh_cn: 他的批评者立即指出，他也不得不在文明之间树起人为的藩篱。

source: To make matters still more difficult, Toynbee lacked an adequate conceptual apparatus for such an ambitious work.
zh_cn: 更糟糕的是，相对于他的壮志而言，汤因比却缺乏一套足够的概念工具。
